app/controllers/eventos_controller.rb

  def index
    @var = Evento.all
    @var1 = User.all
---
SELECT "eventos".* FROM "eventos"
SELECT "users".* FROM "users"