app/controllers/eventos_controller.rb

  def index
    if !user_signed_in?
      redirect_to new_user_session_path
    else
      @d = Date.today
      @t = Time.find_zone("UTC").parse("00:00")
      @t1 = Time.find_zone("UTC").parse("23:59")
      @dataInicial = DateTime.new(@d.year, @d.month, @d.day, @t.hour, @t.min, @t.sec, @t.zone)
      @dataFinal = DateTime.new(@d.year, @d.month, @d.day, @t1.hour, @t1.min, @t1.sec, @t1.zone)

      @eventos = Evento.where("user_id = ? AND data >= ? AND data <= ? ", current_user.id, @dataInicial, @dataFinal).order('data')
      @user = User.find(current_user.id)
---
SELECT "eventos".* FROM "eventos" WHERE (user_id = 34 AND data >= '2019-07-01 00:00:00' AND data <= '2019-07-01 23:59:00' ) ORDER BY data
SELECT "eventos".* FROM "eventos" WHERE "eventos"."user_id" = $1  [["user_id", 13]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]

  def new
    if !user_signed_in?
      redirect_to new_user_session_path
    else
      @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def find
    if !user_signed_in?
      redirect_to new_user_session_path
    else
      @d = Date.parse("" + params[:data])
      @t = Time.find_zone("UTC").parse("00:00")
      @t1 = Time.find_zone("UTC").parse("23:59")
      @dataInicial = DateTime.new(@d.year, @d.month, @d.day, @t.hour, @t.min, @t.sec, @t.zone)
      @dataFinal = DateTime.new(@d.year, @d.month, @d.day, @t1.hour, @t1.min, @t1.sec, @t1.zone)

      @eventos = Evento.where("user_id = ? AND data >= ? AND data <= ? ", current_user.id, @dataInicial, @dataFinal).order('data')
      @user = User.find(current_user.id)
---
SELECT "eventos".* FROM "eventos" WHERE (user_id = 34 AND data >= '2019-06-30 00:00:00' AND data <= '2019-06-30 23:59:00' ) ORDER BY data
SELECT  "eventos".* FROM "eventos" WHERE "eventos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]

  def create_evento
    if !user_signed_in?
      redirect_to new_user_session_path
    else
      @d = Date.parse(params[:date])
      @t = Time.find_zone("UTC").parse(params[:time].to_s)
      @data = DateTime.new(@d.year, @d.month, @d.day, @t.hour, @t.min, @t.sec, @t.zone)
      @var = Evento.new
      @var.user_id = current_user.id
      @var.nome = params[:nome]
      @var.data = @data
      @var.desc = params[:desc]
      if @var.save
---
INSERT INTO "eventos" ("nome", "desc", "data", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "meu evento"], ["desc", "comemorar no lol"], ["data", "2019-07-01 20:20:00"], ["created_at", "2019-07-02 00:48:10.085757"], ["updated_at", "2019-07-02 00:48:10.085757"], ["user_id", 34]]

  def delete
    if !user_signed_in?
      redirect_to new_user_session_path
    else
      @evento = Evento.find(params[:id])

      if @evento.destroy
---
SELECT  "eventos".* FROM "eventos" WHERE "eventos"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
DELETE FROM "eventos" WHERE "eventos"."id" = $1  [["id", 53]]