app/controllers/pages_controller.rb

  def info
    if !user_signed_in?
      redirect_to new_user_session_path
    else
      @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]